{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"collapsible_content_gVg4fz":{"type":"collapsible-content","blocks":{"collapsible_row_zEEx4w":{"type":"collapsible_row","settings":{"heading":"1. What is the duration of personalized African video messages?","icon":"check_mark","row_content":"<p>Regular videos last 40-60 seconds; African-themed videos last 30-60 seconds, which is convenient for sharing on social media.<br\/><br\/><br\/><br\/><br\/><\/p>","page":""}},"collapsible_row_f8Tk8m":{"type":"collapsible_row","settings":{"heading":"2. Which languages are supported for personalized African video greeting content?","icon":"check_mark","row_content":"<p>Video content in any language is acceptable, but each audio clip may only contain one language. For Africa-themed videos, the male voice currently only supports English, and we will gradually roll out other languages for use in the future.<br\/><br\/><br\/><br\/><br\/><br\/><br\/><\/p>","page":""}},"collapsible_row_dciDmc":{"type":"collapsible_row","settings":{"heading":"3. Are there any restrictions on video content?","icon":"check_mark","row_content":"<p>Only positive blessing scenarios (e.g., birthdays, graduations, Father's Day, Mother's Day) are supported, and only positive blessing content is accepted. Content with insults, political sensitivity, or religious sensitivity is rejected. All customized content must be decent; if improper content is found in your request, we will contact you to make modifications before production.<br\/><br\/><br\/><\/p>","page":""}},"collapsible_row_nYaDFN":{"type":"collapsible_row","settings":{"heading":"4. How long does delivery take for personalized African video messages?","icon":"check_mark","row_content":"<p>The regular delivery cycle is a maximum of 1-2 days (the regular delivery cycle for some scenarios is 2-3 working days). Slight delays may occur during peak order periods (we limit daily orders to ensure video quality); if there is a delay, wait 1-2 more days before contacting customer service for inquiry.<br\/><br\/><br\/><br\/><br\/><\/p>","page":""}},"collapsible_row_pqqKBF":{"type":"collapsible_row","settings":{"heading":"5. What are the details of the next day\/priority delivery service?","icon":"check_mark","row_content":"<p>- Service benefits: Demands are given the highest priority; next-day delivery orders are usually completed within 1 day, and priority delivery orders are processed starting from the day after the order is placed.- Special note: All are customized services, so production time needs to be reserved, and the day the order is placed is not included.<br\/><br\/><\/p>","page":""}},"collapsible_row_tDn989":{"type":"collapsible_row","settings":{"heading":"6. How will my personalized African video greeting be delivered?","icon":"check_mark","row_content":"<p>After the video is produced, it will be sent to the email address you provided when placing the order in high-definition MP4 format. No additional download tools are needed, and you only need to check your email.<br\/><br\/><\/p>","page":""}},"collapsible_row_rdykgJ":{"type":"collapsible_row","settings":{"heading":"7. How to select a song for the customized video?","icon":"check_mark","row_content":"<p>You can either provide your favorite song (must include playback time, e.g., \"0:30-0:35\", song name, e.g., \"Stromae - Alors On\", and song link, e.g., YouTube link) or let us select a song that matches the blessing content.<br\/><br\/><\/p>","page":""}},"collapsible_row_9T8wia":{"type":"collapsible_row","settings":{"heading":"8. What's required for text drafting in the customized video?","icon":"check_mark","row_content":"<p>You need to provide 2-4 sentences that you want the people in the video to say (we will write the text on a blackboard or paper), and clearly inform us of the pronunciation requirements for the text to ensure accurate delivery.<br\/><br\/><\/p>","page":""}},"collapsible_row_pW7nWK":{"type":"collapsible_row","settings":{"heading":"9. What photos do I need to upload for my personalized African video greeting?","icon":"check_mark","row_content":"<p>You need to upload 1 photo of the person you want to surprise, which will serve as the core material for video customization.<br\/><br\/><br\/><br\/><\/p>","page":""}},"collapsible_row_FYDMxA":{"type":"collapsible_row","settings":{"heading":"10. What internationally accepted payment methods are supported?","icon":"check_mark","row_content":"<p>We support internationally accepted payments including PayPal, VISA, Mastercard, AMEX, Discover, Diners, Klarna, and Sofort.<br\/><br\/><\/p>","page":""}},"collapsible_row_Uqp8fU":{"type":"collapsible_row","settings":{"heading":"11. What region-specific payment methods are supported?","icon":"check_mark","row_content":"<p>For users in English-speaking countries and regions (such as the United States, the United Kingdom, Canada, Australia, and other countries and regions where English is the primary language), we support the widely used internationally recognized payment methods (including PayPal, VISA, Mastercard, AMEX, Discover, Diners, etc.). Additionally, we offer UnionPay for users in China, provide region-specific payment methods such as IDEAL, KBC Payment, Bancontact, and Belfius Payment for users in the Benelux region, and also support payment methods widely recognized in many European countries like Klarna and Sofort, thus better meeting the payment needs of users in English-speaking countries and different regions around the world.<br\/><br\/><br\/><\/p>","page":""}},"collapsible_row_KYKzid":{"type":"collapsible_row","settings":{"heading":"12. What mobile payment methods are supported?","icon":"check_mark","row_content":"<p>We support mobile payments including Google Pay and Apple Pay.<br\/><br\/><\/p>","page":""}},"collapsible_row_F3eX8a":{"type":"collapsible_row","settings":{"heading":"13. Who is your payment service partner?","icon":"check_mark","row_content":"<p>We have partnered with payment service provider Mollie. This partnership effectively ensures the payment security for users in English-speaking countries and regions (such as the United States, the United Kingdom, Canada, Australia, and other countries and regions where English is the primary language) when using internationally recognized payment methods like PayPal and VISA. In the future, we will continue to add more payment methods based on the needs of users in English-speaking countries and other regions worldwide, with specific details subject to announcements on the official website.<br\/><br\/><br\/><br\/><\/p>","page":""}},"collapsible_row_WeR9PF":{"type":"collapsible_row","settings":{"heading":"14. Can I modify my personalized African video greeting order after submission?","icon":"check_mark","row_content":"<p>If you need to modify order details after submission, you must immediately send an email to the official email address (support@wishesvideo.com) with your order number. However, we cannot guarantee the modification will be done, as the team may have already started the production process.<br\/><br\/><\/p>","page":""}},"collapsible_row_gPqqUn":{"type":"collapsible_row","settings":{"heading":"15. How to inquire about order progress if I can't find the order or haven't received the video?","icon":"check_mark","row_content":"<p>First, check the inbox, spam folder, and other folders of your email (to prevent emails from being misclassified). If you still cannot find the video after the promised delivery time, contact us via the official email address (support@wishesvideo.com), and we will help inquire about the progress.<br\/><br\/><\/p>","page":""}},"collapsible_row_URhRYH":{"type":"collapsible_row","settings":{"heading":"16. Can I get a lost video resent?","icon":"check_mark","row_content":"<p>Yes. If you accidentally lose the received video, we can resend it for free—videos are archived in our system for up to 1 year. You only need to contact customer service and provide your order number, with no additional fees.<br\/><br\/><\/p>","page":""}},"collapsible_row_zyw9Ue":{"type":"collapsible_row","settings":{"heading":"17. Is a refund supported under regular circumstances?","icon":"check_mark","row_content":"<p>No. Refunds are not supported under regular circumstances, as each video is customized according to your exclusive needs and cannot be reused or resold.<br\/><br\/><\/p>","page":""}},"collapsible_row_RyRYLa":{"type":"collapsible_row","settings":{"heading":"18. In which special cases can I apply for a refund, and how?","icon":"check_mark","row_content":"<p>Refunds can only be applied for in case of \"service abnormalities caused by us\" (e.g., failure to deliver as promised for express orders, serious inconsistency between video content and requirements). You need to submit an application via the official email address (support@wishesvideo.com) and provide the order number and relevant evidence (e.g., delay screenshots, video clips with errors), and we will assist in processing after review.<br\/><br\/><\/p>","page":""}},"collapsible_row_GKUDyH":{"type":"collapsible_row","settings":{"heading":"19. Will my video be arbitrarily shared on social media?","icon":"check_mark","row_content":"<p>No. We will not arbitrarily share your video recordings on social media (such as Facebook, Instagram, etc.).<br\/><br\/><\/p>","page":""}},"collapsible_row_mP9bTA":{"type":"collapsible_row","settings":{"heading":"20. How to authorize social media sharing of my video?","icon":"check_mark","row_content":"<p>If you need to authorize sharing, you must send a message to customer service including your order number, clearly stating \"consent to share\", and we will only use the video content after obtaining authorization.<br\/><br\/><\/p>","page":""}},"collapsible_row_9XQEnq":{"type":"collapsible_row","settings":{"heading":"21. What is the official customer service contact information?","icon":"check_mark","row_content":"<p>The official customer service channel is the email address: support@wishesvideo.com. All questions and applications (including order modification, refund application, video resending, etc.) are handled through this email.<br\/><br\/><\/p>","page":""}},"collapsible_row_GCyKNc":{"type":"collapsible_row","settings":{"heading":"22. What are the customer service working hours?","icon":"check_mark","row_content":"<p>The customer service working hours are Monday to Friday, 8:00-23:00 (excluding legal holidays).<br\/><br\/><\/p>","page":""}},"collapsible_row_PmEU6T":{"type":"collapsible_row","settings":{"heading":"23. How long does customer service take to respond?","icon":"check_mark","row_content":"<p>Regular questions will be replied to within 48 hours, and solutions for complex issues (such as refund review, order disputes) will be provided within 7 working days.<br\/><br\/><\/p>","page":""}}},"block_order":["collapsible_row_zEEx4w","collapsible_row_f8Tk8m","collapsible_row_dciDmc","collapsible_row_nYaDFN","collapsible_row_pqqKBF","collapsible_row_tDn989","collapsible_row_rdykgJ","collapsible_row_9T8wia","collapsible_row_pW7nWK","collapsible_row_FYDMxA","collapsible_row_Uqp8fU","collapsible_row_KYKzid","collapsible_row_F3eX8a","collapsible_row_WeR9PF","collapsible_row_gPqqUn","collapsible_row_URhRYH","collapsible_row_zyw9Ue","collapsible_row_RyRYLa","collapsible_row_GKUDyH","collapsible_row_mP9bTA","collapsible_row_9XQEnq","collapsible_row_GCyKNc","collapsible_row_PmEU6T"],"name":"t:sections.collapsible_content.presets.name","settings":{"caption":"","heading":"Frequently Asked Questions About Personalized African Video Messages","heading_size":"h1","heading_alignment":"center","layout":"none","container_color_scheme":"scheme-2","color_scheme":"","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}}},"order":["main","collapsible_content_gVg4fz"]}